# Предпазен найлон - 1.50 лв. за кв. метър
# Боя - 14.50 лв. за литър
# Разредител за боя - 5.00 лв. за литър

# За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м.
# найлон, разбира се и 0.40 лв. за торбички. Сумата, която се заплаща на майсторите за 1 час работа,
# е равна на 30% от сбора на всички разходи за материали.

# Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
nylon = int(input())
# Необходимо количество боя (в литри) - цяло число в интервала [1…100]
paint_litre = int(input())
# Количество разредител (в литри) - цяло число в интервала [1…30]
razreditel_litre = int(input())
# Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
hours = int(input())

total_sum = (nylon + 2) * 1.5 + (paint_litre + (paint_litre * 0.10)) * 14.5 + (razreditel_litre * 5) + 0.40
worker_hours = total_sum * 0.30
all_sum = total_sum + (worker_hours * hours)
print(all_sum)
