# Пилешко меню –  10.35 лв
# Меню с риба – 12.40 лв.
# Вегетарианско меню  – 8.15 лв.

# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.

# Брой пилешки менюта – цяло число в интервала [0 … 99]
chiken_menu = int(input()) * 10.35
# Брой менюта с риба – цяло число в интервала [0 … 99]
fish_menu = int(input()) * 12.40
# Брой вегетариански менюта – цяло число в интервала [0 … 99]
vegan_menu = int(input()) * 8.15
desert = (chiken_menu + fish_menu + vegan_menu ) * 0.20

total_sum = (chiken_menu + fish_menu + vegan_menu + desert + 2.5)

print(f"цената на поръчката {total_sum: 2f}")
