# Пакет химикали - 5.80 лв.
# Пакет маркери - 7.20 лв.
# Препарат - 1.20 лв (за литър)

# Брой пакети химикали - цяло число в интервала [0...100]
pensil_pcs = int(input()) * 5.8
# Брой пакети маркери - цяло число в интервала [0...100]
markers_pcs = int(input()) * 7.2
# Литри препарат за почистване на дъска - цяло число в интервала [0…50]
litres = int(input()) * 1.2
# Процент намаление - цяло число в интервала [0...100]
discount = int(input()) / 100
# Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.

all_sum = pensil_pcs + markers_pcs + litres
discount_sum = all_sum * discount
total_sum = all_sum - discount_sum
print(total_sum)

